AL-255/gbjit-xtensa/boards/HTIT-WB32LAF_V3.2/sdkconfig.defaults
# HTIT-WB32LAF_V3.2 — ESP32-S3 dev board with onboard I2C SSD1306 OLED.
# Pin map (see main/board.h): OLED_SDA=GPIO17, OLED_SCL=GPIO18, OLED_RST=GPIO20.

CONFIG_IDF_TARGET="esp32s3"

# Console on UART0.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Release build.
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Keep memprot off — the JIT codecache lives in static IRAM, writes via
# the data path, and would trip memprot if it were on.
CONFIG_ESP_SYSTEM_MEMPROT_FEATURE=n

# Disable both watchdogs — the dispatcher's busy-loop does no yields.
CONFIG_ESP_INT_WDT=n
CONFIG_ESP_TASK_WDT_EN=n

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Run the core at its rated max (240 MHz). The ESP32-S3 datasheet
# specifies 240 MHz as the maximum supported clock; ESP-IDF only
# exposes 80/160/240 (the three PLL output paths). Pushing past 240 on
# this part requires register-poking the PLL chain which is unsupported
# and unstable across units / temperatures — we keep to the datasheet.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Note: QIO/120 MHz flash both tripped an IDF v6.0.1 compile bug in
# components/spi_flash/spi_flash_hpm_enable.c on this toolchain.
# Keeping the default DIO @ 80 MHz; the JIT win from faster flash is
# small relative to chasing that breakage.

# --- Release-mode debug-feature stripping ----------------------------
# Lower the ESP-IDF runtime log level past ERROR. Boot banners go
# away; ERROR-level prints (which are real failures we want to see)
# still come through. Production firmware shouldn't spam INFO logs
# at any rate.
CONFIG_LOG_DEFAULT_LEVEL_ERROR=y
CONFIG_LOG_DEFAULT_LEVEL=1
# Maximum compile-time log level — the LOG_LOCAL_LEVEL guards in IDF
# headers gate ESP_LOG* expansion on this; setting it to ERROR makes
# the INFO/WARN macros expand to nothing, dropping the strings out of
# .rodata.
CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=y
CONFIG_LOG_MAXIMUM_LEVEL_ERROR=y
CONFIG_LOG_MAXIMUM_LEVEL=1
# Compile out assert() — the JIT's emit_xtensa.c has many asserts on
# encoder invariants that we hit thousands of times per block compile.
# At -O3 they fold into nothing but assert() itself still emits a
# function-call boundary; NDEBUG removes that path entirely.
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y
# Strip the bootloader's INFO logs too. Saves a few ms of boot time
# (cosmetic) and a couple of KB of bootloader .rodata.
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_BOOTLOADER_LOG_LEVEL=2
